# Створіть 3 рiзних функцiї (на ваш вибiр).
# Кожна з цих функцiй повинна повертати якийсь результат (напр. інпут від юзера, результат математичної операції тощо).
# Також створiть четверту ф-цiю, яка всередині викликає 3 попередні,
# обробляє їх результат та також повертає результат своєї роботи.
# Таким чином ми будемо викликати одну (четверту) функцiю, а вона в своєму тiлi- ще 3.



import random



def ask_name():
    print('Я можу передбачити твоє майбутнє')
    name = input('Як тебе звати? ')
    if name:
        return name
    else:
        return 'Анонім'


def choose_predict():
    predicts = ('виграєш у лотерею', 'закохаєшся', 'захворієш',
                'купиш нове авто', 'переїдеш в інше місто',
                'знайдеш 100 гривень у куртці', 'отримаєш підвищення')
    predict = random.choice(predicts)
    return predict


def choose_time():
    periods = ('завтра', 'післязавтра', 'наступного місяця',
               'наступного тижня', 'наступного року')
    predict = random.choice(periods)
    return predict


def make_predict():
    return f'Я бачу, {ask_name()}, ти {choose_predict()} {choose_time()}. (Але це не точно...)'


print(make_predict())
