# Користувач вводить змінні "x" та "y" з довільними цифровими значеннями.
# Створіть просту умовну конструкцію (звiсно вона повинна бути в тiлi ф-цiї),
# під час виконання якої буде перевірятися рівність змінних "x" та "y"
# та у випадку нерівності - виводити ще і різницю.


def compare_numbers(x, y):
    if x > y:
        return f'x більше y на {x - y}'
    elif x < y:
        return f'y більше x на {y - x}'
    else:
        return 'x дорівнює y'


x = int(input('Введіть значення для "Х": '))
y = int(input('Введіть значення для "Y": '))

print(compare_numbers(x, y))
