# Написати функцію, яка буде реалізувати логіку циклічного зсуву елементів
# в списку.Тобто функція приймає два аргументи: список і величину зсуву(якщо
# ця величина додатна - пересуваємо з кінця на початок, якщо від'ємна - навпаки'
# пересуваємо елементи з початку списку в його кінець).
# Наприклад:
# fnc([1, 2, 3, 4, 5], shift=1) --> [5, 1, 2, 3, 4]
# fnc([1, 2, 3, 4, 5], shift=-1) --> [3, 4, 5, 1, 2]


def func_task6(my_list, shift):
    if shift == 0:
        return my_list
    elif shift > 0:
        return my_list[-shift:] + my_list[:-shift]
    else:
        return my_list[abs(shift):] + my_list[:abs(shift)]


my_list = [1, 2, 3, 4, 5, 6]
shift = int(input('Введите значение сдвига: '))
print(func_task6(my_list, shift))
